In [1]:
import numpy as np
import pandas as pd

In [8]:
dict1 ={"isim" : ["Ahmet","Mehmet","Ali","Veli"],
       "spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
       "kalori": [100,200,300,400]}

In [9]:
df1 = pd.DataFrame(dict1 , index = [0,1,2,3])

In [10]:
df1

     isim       spor  kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2     Ali       Koşu     300
3    Veli  Basketbol     400

In [11]:
dict2 ={"isim" : ["Osman","Levent","Atlas","Fatma"],
       "spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
       "kalori": [200,100,50,300]}

In [14]:
df2 = pd.DataFrame(dict2 , index = [4,5,6,7])

In [15]:
df2

     isim       spor  kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [16]:
dict3 ={"isim" : ["Ayse","Mahmut","Duygu","Nur"],
       "spor" : ["Koşu","Yüzme","Badminton","Tenis"],
       "kalori": [300,400,500,250]}

In [17]:
df3 = pd.DataFrame(dict3, index = [8,9,10,11])

In [18]:
df3

      isim       spor  kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## concatenation

In [20]:
pd.concat([df1,df2,df3], axis = 0)  # df , sütun formatları aynı ise kullanışlı , axis = 0 , default

      isim       spor  kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2      Ali       Koşu     300
3     Veli  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## merge

In [22]:
dictmerge1 ={"isim" : ["Ahmet","Mehmet","Zeynep","Ali"],
       "spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [23]:
dfmerge1 = pd.DataFrame(dictmerge1)

In [24]:
dfmerge1

     isim       spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3     Ali  Basketbol

In [30]:
dictmerge2 ={"isim" : ["Ahmet","Mehmet","Zeynep","Ali"],
             "kalori" : [100,200,150,250]}

In [27]:
dfmerge2 = pd.DataFrame(dictmerge2)

In [28]:
dfmerge2

     isim  kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3     Ali     250

In [31]:
pd.merge(dfmerge1,dfmerge2, on = "isim")  # iki df içinde ortak bir sütun olmalı

     isim       spor  kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3     Ali  Basketbol     250

In [32]:
salaryDict = {"isim" : ["Ali" , "Zeynep","Mehmet","Ahmet"],
              "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas" : [200,300,400,500]}

In [33]:
salarydf = pd.DataFrame(salaryDict)

In [34]:
salarydf

     isim  Departman  Maas
0     Ali    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [35]:
salarydf["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [41]:
salarydf["Departman"].nunique()   # uniq değer sayısı

3

In [37]:
salarydf["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [39]:
def bruttenNete(maas):
    return maas * 0.66

In [40]:
salarydf["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [42]:
salarydf.isnull()

    isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## pivot table

In [53]:
dictCart = {"Karakter Sınıfı" : ["Tom_Jerry","Tom_Jerry","Candy_Heidi","Candy_Heidi"],
             "Karakter ismi" : ["Tom","Jerry","Candy","Heidi"],
             "Karakter Yas" : [9,10,25,30]}

In [54]:
caracterDf = pd.DataFrame(dictCart)

In [55]:
caracterDf

  Karakter Sınıfı Karakter ismi  Karakter Yas
0       Tom_Jerry           Tom             9
1       Tom_Jerry         Jerry            10
2     Candy_Heidi         Candy            25
3     Candy_Heidi         Heidi            30

In [56]:
caracterDf.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı","Karakter ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter ismi
Candy_Heidi     Candy                  25.0
                Heidi                  30.0
Tom_Jerry       Jerry                  10.0
                Tom                     9.0